Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/pio/samrh71f20c.h
/* ========== Peripheral I/O masks ========== */
#define PIO_PA0                     (_U_(1) << 0)   /**< PIO mask for PA0 */
#define PIO_PA1                     (_U_(1) << 1)   /**< PIO mask for PA1 */
#define PIO_PA2                     (_U_(1) << 2)   /**< PIO mask for PA2 */
#define PIO_PA3                     (_U_(1) << 3)   /**< PIO mask for PA3 */
#define PIO_PA4                     (_U_(1) << 4)   /**< PIO mask for PA4 */
#define PIO_PA5                     (_U_(1) << 5)   /**< PIO mask for PA5 */
#define PIO_PA6                     (_U_(1) << 6)   /**< PIO mask for PA6 */
#define PIO_PA7                     (_U_(1) << 7)   /**< PIO mask for PA7 */
#define PIO_PA8                     (_U_(1) << 8)   /**< PIO mask for PA8 */
#define PIO_PA9                     (_U_(1) << 9)   /**< PIO mask for PA9 */
#define PIO_PA10                    (_U_(1) << 10)  /**< PIO mask for PA10 */
#define PIO_PA11                    (_U_(1) << 11)  /**< PIO mask for PA11 */
#define PIO_PA12                    (_U_(1) << 12)  /**< PIO mask for PA12 */
#define PIO_PA13                    (_U_(1) << 13)  /**< PIO mask for PA13 */
#define PIO_PA16                    (_U_(1) << 16)  /**< PIO mask for PA16 */
#define PIO_PA17                    (_U_(1) << 17)  /**< PIO mask for PA17 */
#define PIO_PA19                    (_U_(1) << 19)  /**< PIO mask for PA19 */
#define PIO_PA20                    (_U_(1) << 20)  /**< PIO mask for PA20 */
#define PIO_PA21                    (_U_(1) << 21)  /**< PIO mask for PA21 */
#define PIO_PA22                    (_U_(1) << 22)  /**< PIO mask for PA22 */
#define PIO_PA23                    (_U_(1) << 23)  /**< PIO mask for PA23 */
#define PIO_PA24                    (_U_(1) << 24)  /**< PIO mask for PA24 */
#define PIO_PA25                    (_U_(1) << 25)  /**< PIO mask for PA25 */
#define PIO_PA26                    (_U_(1) << 26)  /**< PIO mask for PA26 */
#define PIO_PA27                    (_U_(1) << 27)  /**< PIO mask for PA27 */
#define PIO_PA28                    (_U_(1) << 28)  /**< PIO mask for PA28 */
#define PIO_PB0                     (_U_(1) << 0)   /**< PIO mask for PB0 */
#define PIO_PB1                     (_U_(1) << 1)   /**< PIO mask for PB1 */
#define PIO_PB2                     (_U_(1) << 2)   /**< PIO mask for PB2 */
#define PIO_PB3                     (_U_(1) << 3)   /**< PIO mask for PB3 */
#define PIO_PB4                     (_U_(1) << 4)   /**< PIO mask for PB4 */
#define PIO_PB5                     (_U_(1) << 5)   /**< PIO mask for PB5 */
#define PIO_PB6                     (_U_(1) << 6)   /**< PIO mask for PB6 */
#define PIO_PB7                     (_U_(1) << 7)   /**< PIO mask for PB7 */
#define PIO_PB8                     (_U_(1) << 8)   /**< PIO mask for PB8 */
#define PIO_PB9                     (_U_(1) << 9)   /**< PIO mask for PB9 */
#define PIO_PB10                    (_U_(1) << 10)  /**< PIO mask for PB10 */
#define PIO_PB11                    (_U_(1) << 11)  /**< PIO mask for PB11 */
#define PIO_PB12                    (_U_(1) << 12)  /**< PIO mask for PB12 */
#define PIO_PB13                    (_U_(1) << 13)  /**< PIO mask for PB13 */
#define PIO_PB14                    (_U_(1) << 14)  /**< PIO mask for PB14 */
#define PIO_PB15                    (_U_(1) << 15)  /**< PIO mask for PB15 */
#define PIO_PB16                    (_U_(1) << 16)  /**< PIO mask for PB16 */
#define PIO_PB17                    (_U_(1) << 17)  /**< PIO mask for PB17 */
#define PIO_PB18                    (_U_(1) << 18)  /**< PIO mask for PB18 */
#define PIO_PB19                    (_U_(1) << 19)  /**< PIO mask for PB19 */
#define PIO_PB20                    (_U_(1) << 20)  /**< PIO mask for PB20 */
#define PIO_PB21                    (_U_(1) << 21)  /**< PIO mask for PB21 */
#define PIO_PB22                    (_U_(1) << 22)  /**< PIO mask for PB22 */
#define PIO_PB23                    (_U_(1) << 23)  /**< PIO mask for PB23 */
#define PIO_PB24                    (_U_(1) << 24)  /**< PIO mask for PB24 */
#define PIO_PB25                    (_U_(1) << 25)  /**< PIO mask for PB25 */
#define PIO_PB26                    (_U_(1) << 26)  /**< PIO mask for PB26 */
#define PIO_PB27                    (_U_(1) << 27)  /**< PIO mask for PB27 */
#define PIO_PB28                    (_U_(1) << 28)  /**< PIO mask for PB28 */
#define PIO_PB29                    (_U_(1) << 29)  /**< PIO mask for PB29 */
#define PIO_PC0                     (_U_(1) << 0)   /**< PIO mask for PC0 */
#define PIO_PC1                     (_U_(1) << 1)   /**< PIO mask for PC1 */
#define PIO_PC2                     (_U_(1) << 2)   /**< PIO mask for PC2 */
#define PIO_PC3                     (_U_(1) << 3)   /**< PIO mask for PC3 */
#define PIO_PC4                     (_U_(1) << 4)   /**< PIO mask for PC4 */
#define PIO_PC5                     (_U_(1) << 5)   /**< PIO mask for PC5 */
#define PIO_PC6                     (_U_(1) << 6)   /**< PIO mask for PC6 */
#define PIO_PC7                     (_U_(1) << 7)   /**< PIO mask for PC7 */
#define PIO_PC8                     (_U_(1) << 8)   /**< PIO mask for PC8 */
#define PIO_PC9                     (_U_(1) << 9)   /**< PIO mask for PC9 */
#define PIO_PC10                    (_U_(1) << 10)  /**< PIO mask for PC10 */
#define PIO_PC11                    (_U_(1) << 11)  /**< PIO mask for PC11 */
#define PIO_PC12                    (_U_(1) << 12)  /**< PIO mask for PC12 */
#define PIO_PC13                    (_U_(1) << 13)  /**< PIO mask for PC13 */
#define PIO_PC14                    (_U_(1) << 14)  /**< PIO mask for PC14 */
#define PIO_PC15                    (_U_(1) << 15)  /**< PIO mask for PC15 */
#define PIO_PC16                    (_U_(1) << 16)  /**< PIO mask for PC16 */
#define PIO_PC17                    (_U_(1) << 17)  /**< PIO mask for PC17 */
#define PIO_PC18                    (_U_(1) << 18)  /**< PIO mask for PC18 */
#define PIO_PC19                    (_U_(1) << 19)  /**< PIO mask for PC19 */
#define PIO_PC20                    (_U_(1) << 20)  /**< PIO mask for PC20 */
#define PIO_PC21                    (_U_(1) << 21)  /**< PIO mask for PC21 */
#define PIO_PC22                    (_U_(1) << 22)  /**< PIO mask for PC22 */
#define PIO_PC23                    (_U_(1) << 23)  /**< PIO mask for PC23 */
#define PIO_PC24                    (_U_(1) << 24)  /**< PIO mask for PC24 */
#define PIO_PC25                    (_U_(1) << 25)  /**< PIO mask for PC25 */
#define PIO_PC26                    (_U_(1) << 26)  /**< PIO mask for PC26 */
#define PIO_PC27                    (_U_(1) << 27)  /**< PIO mask for PC27 */
#define PIO_PC28                    (_U_(1) << 28)  /**< PIO mask for PC28 */
#define PIO_PC29                    (_U_(1) << 29)  /**< PIO mask for PC29 */
#define PIO_PC30                    (_U_(1) << 30)  /**< PIO mask for PC30 */
#define PIO_PC31                    (_U_(1) << 31)  /**< PIO mask for PC31 */
#define PIO_PD0                     (_U_(1) << 0)   /**< PIO mask for PD0 */
#define PIO_PD1                     (_U_(1) << 1)   /**< PIO mask for PD1 */
#define PIO_PD2                     (_U_(1) << 2)   /**< PIO mask for PD2 */
#define PIO_PD3                     (_U_(1) << 3)   /**< PIO mask for PD3 */
#define PIO_PD4                     (_U_(1) << 4)   /**< PIO mask for PD4 */
#define PIO_PD5                     (_U_(1) << 5)   /**< PIO mask for PD5 */
#define PIO_PD6                     (_U_(1) << 6)   /**< PIO mask for PD6 */
#define PIO_PD7                     (_U_(1) << 7)   /**< PIO mask for PD7 */
#define PIO_PD8                     (_U_(1) << 8)   /**< PIO mask for PD8 */
#define PIO_PD9                     (_U_(1) << 9)   /**< PIO mask for PD9 */
#define PIO_PD10                    (_U_(1) << 10)  /**< PIO mask for PD10 */
#define PIO_PD11                    (_U_(1) << 11)  /**< PIO mask for PD11 */
#define PIO_PD12                    (_U_(1) << 12)  /**< PIO mask for PD12 */
#define PIO_PD13                    (_U_(1) << 13)  /**< PIO mask for PD13 */
#define PIO_PD14                    (_U_(1) << 14)  /**< PIO mask for PD14 */
#define PIO_PD15                    (_U_(1) << 15)  /**< PIO mask for PD15 */
#define PIO_PD16                    (_U_(1) << 16)  /**< PIO mask for PD16 */
#define PIO_PD17                    (_U_(1) << 17)  /**< PIO mask for PD17 */
#define PIO_PD18                    (_U_(1) << 18)  /**< PIO mask for PD18 */
#define PIO_PD19                    (_U_(1) << 19)  /**< PIO mask for PD19 */
#define PIO_PD20                    (_U_(1) << 20)  /**< PIO mask for PD20 */
#define PIO_PD21                    (_U_(1) << 21)  /**< PIO mask for PD21 */
#define PIO_PD22                    (_U_(1) << 22)  /**< PIO mask for PD22 */
#define PIO_PD23                    (_U_(1) << 23)  /**< PIO mask for PD23 */
#define PIO_PD24                    (_U_(1) << 24)  /**< PIO mask for PD24 */
#define PIO_PD25                    (_U_(1) << 25)  /**< PIO mask for PD25 */
#define PIO_PD26                    (_U_(1) << 26)  /**< PIO mask for PD26 */
#define PIO_PD27                    (_U_(1) << 27)  /**< PIO mask for PD27 */
#define PIO_PD28                    (_U_(1) << 28)  /**< PIO mask for PD28 */
#define PIO_PD29                    (_U_(1) << 29)  /**< PIO mask for PD29 */
#define PIO_PD30                    (_U_(1) << 30)  /**< PIO mask for PD30 */
#define PIO_PD31                    (_U_(1) << 31)  /**< PIO mask for PD31 */
#define PIO_PE0                     (_U_(1) << 0)   /**< PIO mask for PE0 */
#define PIO_PE1                     (_U_(1) << 1)   /**< PIO mask for PE1 */
#define PIO_PE2                     (_U_(1) << 2)   /**< PIO mask for PE2 */
#define PIO_PE3                     (_U_(1) << 3)   /**< PIO mask for PE3 */
#define PIO_PE4                     (_U_(1) << 4)   /**< PIO mask for PE4 */
#define PIO_PE5                     (_U_(1) << 5)   /**< PIO mask for PE5 */
#define PIO_PE6                     (_U_(1) << 6)   /**< PIO mask for PE6 */
#define PIO_PE7                     (_U_(1) << 7)   /**< PIO mask for PE7 */
#define PIO_PE8                     (_U_(1) << 8)   /**< PIO mask for PE8 */
#define PIO_PE9                     (_U_(1) << 9)   /**< PIO mask for PE9 */
#define PIO_PE10                    (_U_(1) << 10)  /**< PIO mask for PE10 */
#define PIO_PE11                    (_U_(1) << 11)  /**< PIO mask for PE11 */
#define PIO_PE12                    (_U_(1) << 12)  /**< PIO mask for PE12 */
#define PIO_PF0                     (_U_(1) << 0)   /**< PIO mask for PF0 */
#define PIO_PF1                     (_U_(1) << 1)   /**< PIO mask for PF1 */
#define PIO_PF2                     (_U_(1) << 2)   /**< PIO mask for PF2 */
#define PIO_PF3                     (_U_(1) << 3)   /**< PIO mask for PF3 */
#define PIO_PF4                     (_U_(1) << 4)   /**< PIO mask for PF4 */
#define PIO_PF5                     (_U_(1) << 5)   /**< PIO mask for PF5 */
#define PIO_PF6                     (_U_(1) << 6)   /**< PIO mask for PF6 */
#define PIO_PF7                     (_U_(1) << 7)   /**< PIO mask for PF7 */
#define PIO_PF8                     (_U_(1) << 8)   /**< PIO mask for PF8 */
#define PIO_PF9                     (_U_(1) << 9)   /**< PIO mask for PF9 */
#define PIO_PF10                    (_U_(1) << 10)  /**< PIO mask for PF10 */
#define PIO_PF11                    (_U_(1) << 11)  /**< PIO mask for PF11 */
#define PIO_PF12                    (_U_(1) << 12)  /**< PIO mask for PF12 */
#define PIO_PF13                    (_U_(1) << 13)  /**< PIO mask for PF13 */
#define PIO_PF14                    (_U_(1) << 14)  /**< PIO mask for PF14 */
#define PIO_PF15                    (_U_(1) << 15)  /**< PIO mask for PF15 */
#define PIO_PF16                    (_U_(1) << 16)  /**< PIO mask for PF16 */
#define PIO_PF17                    (_U_(1) << 17)  /**< PIO mask for PF17 */
#define PIO_PF18                    (_U_(1) << 18)  /**< PIO mask for PF18 */
#define PIO_PF19                    (_U_(1) << 19)  /**< PIO mask for PF19 */
#define PIO_PF20                    (_U_(1) << 20)  /**< PIO mask for PF20 */
#define PIO_PF21                    (_U_(1) << 21)  /**< PIO mask for PF21 */
#define PIO_PF22                    (_U_(1) << 22)  /**< PIO mask for PF22 */
#define PIO_PF23                    (_U_(1) << 23)  /**< PIO mask for PF23 */
#define PIO_PF24                    (_U_(1) << 24)  /**< PIO mask for PF24 */
#define PIO_PF25                    (_U_(1) << 25)  /**< PIO mask for PF25 */
#define PIO_PF26                    (_U_(1) << 26)  /**< PIO mask for PF26 */
#define PIO_PF27                    (_U_(1) << 27)  /**< PIO mask for PF27 */
#define PIO_PF28                    (_U_(1) << 28)  /**< PIO mask for PF28 */
#define PIO_PF29                    (_U_(1) << 29)  /**< PIO mask for PF29 */
#define PIO_PF30                    (_U_(1) << 30)  /**< PIO mask for PF30 */
#define PIO_PG0                     (_U_(1) << 0)   /**< PIO mask for PG0 */
#define PIO_PG1                     (_U_(1) << 1)   /**< PIO mask for PG1 */
#define PIO_PG2                     (_U_(1) << 2)   /**< PIO mask for PG2 */
#define PIO_PG3                     (_U_(1) << 3)   /**< PIO mask for PG3 */
#define PIO_PG4                     (_U_(1) << 4)   /**< PIO mask for PG4 */
#define PIO_PG5                     (_U_(1) << 5)   /**< PIO mask for PG5 */
#define PIO_PG6                     (_U_(1) << 6)   /**< PIO mask for PG6 */
#define PIO_PG7                     (_U_(1) << 7)   /**< PIO mask for PG7 */
#define PIO_PG8                     (_U_(1) << 8)   /**< PIO mask for PG8 */
#define PIO_PG9                     (_U_(1) << 9)   /**< PIO mask for PG9 */
#define PIO_PG10                    (_U_(1) << 10)  /**< PIO mask for PG10 */
#define PIO_PG11                    (_U_(1) << 11)  /**< PIO mask for PG11 */
#define PIO_PG12                    (_U_(1) << 12)  /**< PIO mask for PG12 */
#define PIO_PG13                    (_U_(1) << 13)  /**< PIO mask for PG13 */
#define PIO_PG14                    (_U_(1) << 14)  /**< PIO mask for PG14 */
#define PIO_PG15                    (_U_(1) << 15)  /**< PIO mask for PG15 */
#define PIO_PG16                    (_U_(1) << 16)  /**< PIO mask for PG16 */
#define PIO_PG17                    (_U_(1) << 17)  /**< PIO mask for PG17 */
#define PIO_PG18                    (_U_(1) << 18)  /**< PIO mask for PG18 */
#define PIO_PG19                    (_U_(1) << 19)  /**< PIO mask for PG19 */
#define PIO_PG20                    (_U_(1) << 20)  /**< PIO mask for PG20 */
#define PIO_PG21                    (_U_(1) << 21)  /**< PIO mask for PG21 */
#define PIO_PG22                    (_U_(1) << 22)  /**< PIO mask for PG22 */
#define PIO_PG23                    (_U_(1) << 23)  /**< PIO mask for PG23 */
#define PIO_PG24                    (_U_(1) << 24)  /**< PIO mask for PG24 */
#define PIO_PG25                    (_U_(1) << 25)  /**< PIO mask for PG25 */
#define PIO_PG26                    (_U_(1) << 26)  /**< PIO mask for PG26 */
#define PIO_PG27                    (_U_(1) << 27)  /**< PIO mask for PG27 */
#define PIO_PG30                    (_U_(1) << 30)  /**< PIO mask for PG30 */
#define PIO_PG31                    (_U_(1) << 31)  /**< PIO mask for PG31 */

