Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/pio/samrh71f20c.h
#define MUX_PG1A_HEMC_A1                           _L_(0)       /**< HEMC signal line function value: HEMC_A1 */
#define PIO_PG1A_HEMC_A1                           (_U_(1) << 1) /**< HEMC signal: HEMC_A1 */
#define PIN_PG2A_HEMC_A2                           _L_(194)     /**< HEMC signal: HEMC_A2 on PG2 mux A */
#define MUX_PG2A_HEMC_A2                           _L_(0)       /**< HEMC signal line function value: HEMC_A2 */
#define PIO_PG2A_HEMC_A2                           (_U_(1) << 2) /**< HEMC signal: HEMC_A2 */
#define PIN_PG3A_HEMC_A3                           _L_(195)     /**< HEMC signal: HEMC_A3 on PG3 mux A */
#define MUX_PG3A_HEMC_A3                           _L_(0)       /**< HEMC signal line function value: HEMC_A3 */
#define PIO_PG3A_HEMC_A3                           (_U_(1) << 3) /**< HEMC signal: HEMC_A3 */
#define PIN_PG4A_HEMC_A4                           _L_(196)     /**< HEMC signal: HEMC_A4 on PG4 mux A */
#define MUX_PG4A_HEMC_A4                           _L_(0)       /**< HEMC signal line function value: HEMC_A4 */
#define PIO_PG4A_HEMC_A4                           (_U_(1) << 4) /**< HEMC signal: HEMC_A4 */
#define PIN_PG5A_HEMC_A5                           _L_(197)     /**< HEMC signal: HEMC_A5 on PG5 mux A */
#define MUX_PG5A_HEMC_A5                           _L_(0)       /**< HEMC signal line function value: HEMC_A5 */
#define PIO_PG5A_HEMC_A5                           (_U_(1) << 5) /**< HEMC signal: HEMC_A5 */
#define PIN_PG6A_HEMC_A6                           _L_(198)     /**< HEMC signal: HEMC_A6 on PG6 mux A */
#define MUX_PG6A_HEMC_A6                           _L_(0)       /**< HEMC signal line function value: HEMC_A6 */
#define PIO_PG6A_HEMC_A6                           (_U_(1) << 6) /**< HEMC signal: HEMC_A6 */
#define PIN_PG7A_HEMC_A7                           _L_(199)     /**< HEMC signal: HEMC_A7 on PG7 mux A */
#define MUX_PG7A_HEMC_A7                           _L_(0)       /**< HEMC signal line function value: HEMC_A7 */
#define PIO_PG7A_HEMC_A7                           (_U_(1) << 7) /**< HEMC signal: HEMC_A7 */
#define PIN_PG8A_HEMC_A8                           _L_(200)     /**< HEMC signal: HEMC_A8 on PG8 mux A */
#define MUX_PG8A_HEMC_A8                           _L_(0)       /**< HEMC signal line function value: HEMC_A8 */
#define PIO_PG8A_HEMC_A8                           (_U_(1) << 8) /**< HEMC signal: HEMC_A8 */
#define PIN_PG9A_HEMC_A9                           _L_(201)     /**< HEMC signal: HEMC_A9 on PG9 mux A */
#define MUX_PG9A_HEMC_A9                           _L_(0)       /**< HEMC signal line function value: HEMC_A9 */
#define PIO_PG9A_HEMC_A9                           (_U_(1) << 9) /**< HEMC signal: HEMC_A9 */
#define PIN_PG10A_HEMC_A10                         _L_(202)     /**< HEMC signal: HEMC_A10 on PG10 mux A */
#define MUX_PG10A_HEMC_A10                         _L_(0)       /**< HEMC signal line function value: HEMC_A10 */
#define PIO_PG10A_HEMC_A10                         (_U_(1) << 10) /**< HEMC signal: HEMC_A10 */
#define PIN_PG11A_HEMC_A11                         _L_(203)     /**< HEMC signal: HEMC_A11 on PG11 mux A */
#define MUX_PG11A_HEMC_A11                         _L_(0)       /**< HEMC signal line function value: HEMC_A11 */
#define PIO_PG11A_HEMC_A11                         (_U_(1) << 11) /**< HEMC signal: HEMC_A11 */
#define PIN_PG12A_HEMC_A12                         _L_(204)     /**< HEMC signal: HEMC_A12 on PG12 mux A */
#define MUX_PG12A_HEMC_A12                         _L_(0)       /**< HEMC signal line function value: HEMC_A12 */
#define PIO_PG12A_HEMC_A12                         (_U_(1) << 12) /**< HEMC signal: HEMC_A12 */
#define PIN_PG13A_HEMC_A13                         _L_(205)     /**< HEMC signal: HEMC_A13 on PG13 mux A */
#define MUX_PG13A_HEMC_A13                         _L_(0)       /**< HEMC signal line function value: HEMC_A13 */
#define PIO_PG13A_HEMC_A13                         (_U_(1) << 13) /**< HEMC signal: HEMC_A13 */
#define PIN_PG14A_HEMC_A14                         _L_(206)     /**< HEMC signal: HEMC_A14 on PG14 mux A */
#define MUX_PG14A_HEMC_A14                         _L_(0)       /**< HEMC signal line function value: HEMC_A14 */
#define PIO_PG14A_HEMC_A14                         (_U_(1) << 14) /**< HEMC signal: HEMC_A14 */
#define PIN_PG15A_HEMC_A15                         _L_(207)     /**< HEMC signal: HEMC_A15 on PG15 mux A */
#define MUX_PG15A_HEMC_A15                         _L_(0)       /**< HEMC signal line function value: HEMC_A15 */
#define PIO_PG15A_HEMC_A15                         (_U_(1) << 15) /**< HEMC signal: HEMC_A15 */
#define PIN_PG16A_HEMC_A16                         _L_(208)     /**< HEMC signal: HEMC_A16 on PG16 mux A */
#define MUX_PG16A_HEMC_A16                         _L_(0)       /**< HEMC signal line function value: HEMC_A16 */
#define PIO_PG16A_HEMC_A16                         (_U_(1) << 16) /**< HEMC signal: HEMC_A16 */
#define PIN_PG17A_HEMC_A17                         _L_(209)     /**< HEMC signal: HEMC_A17 on PG17 mux A */
#define MUX_PG17A_HEMC_A17                         _L_(0)       /**< HEMC signal line function value: HEMC_A17 */
#define PIO_PG17A_HEMC_A17                         (_U_(1) << 17) /**< HEMC signal: HEMC_A17 */
#define PIN_PG18A_HEMC_A18                         _L_(210)     /**< HEMC signal: HEMC_A18 on PG18 mux A */
#define MUX_PG18A_HEMC_A18                         _L_(0)       /**< HEMC signal line function value: HEMC_A18 */
#define PIO_PG18A_HEMC_A18                         (_U_(1) << 18) /**< HEMC signal: HEMC_A18 */
#define PIN_PG19A_HEMC_A19                         _L_(211)     /**< HEMC signal: HEMC_A19 on PG19 mux A */
#define MUX_PG19A_HEMC_A19                         _L_(0)       /**< HEMC signal line function value: HEMC_A19 */
#define PIO_PG19A_HEMC_A19                         (_U_(1) << 19) /**< HEMC signal: HEMC_A19 */
#define PIN_PG20A_HEMC_A20                         _L_(212)     /**< HEMC signal: HEMC_A20 on PG20 mux A */
#define MUX_PG20A_HEMC_A20                         _L_(0)       /**< HEMC signal line function value: HEMC_A20 */
#define PIO_PG20A_HEMC_A20                         (_U_(1) << 20) /**< HEMC signal: HEMC_A20 */
#define PIN_PG21A_HEMC_A21                         _L_(213)     /**< HEMC signal: HEMC_A21 on PG21 mux A */
#define MUX_PG21A_HEMC_A21                         _L_(0)       /**< HEMC signal line function value: HEMC_A21 */
#define PIO_PG21A_HEMC_A21                         (_U_(1) << 21) /**< HEMC signal: HEMC_A21 */
#define PIN_PG22A_HEMC_A22                         _L_(214)     /**< HEMC signal: HEMC_A22 on PG22 mux A */
#define MUX_PG22A_HEMC_A22                         _L_(0)       /**< HEMC signal line function value: HEMC_A22 */
#define PIO_PG22A_HEMC_A22                         (_U_(1) << 22) /**< HEMC signal: HEMC_A22 */
#define PIN_PG23A_HEMC_A23                         _L_(215)     /**< HEMC signal: HEMC_A23 on PG23 mux A */
#define MUX_PG23A_HEMC_A23                         _L_(0)       /**< HEMC signal line function value: HEMC_A23 */
#define PIO_PG23A_HEMC_A23                         (_U_(1) << 23) /**< HEMC signal: HEMC_A23 */
#define PIN_PG24A_HEMC_A24                         _L_(216)     /**< HEMC signal: HEMC_A24 on PG24 mux A */
#define MUX_PG24A_HEMC_A24                         _L_(0)       /**< HEMC signal line function value: HEMC_A24 */
#define PIO_PG24A_HEMC_A24                         (_U_(1) << 24) /**< HEMC signal: HEMC_A24 */
#define PIN_PG25A_HEMC_A25                         _L_(217)     /**< HEMC signal: HEMC_A25 on PG25 mux A */
#define MUX_PG25A_HEMC_A25                         _L_(0)       /**< HEMC signal line function value: HEMC_A25 */
#define PIO_PG25A_HEMC_A25                         (_U_(1) << 25) /**< HEMC signal: HEMC_A25 */
#define PIN_PG26A_HEMC_A26                         _L_(218)     /**< HEMC signal: HEMC_A26 on PG26 mux A */
#define MUX_PG26A_HEMC_A26                         _L_(0)       /**< HEMC signal line function value: HEMC_A26 */
#define PIO_PG26A_HEMC_A26                         (_U_(1) << 26) /**< HEMC signal: HEMC_A26 */
#define PIN_PG27A_HEMC_A27                         _L_(219)     /**< HEMC signal: HEMC_A27 on PG27 mux A */
#define MUX_PG27A_HEMC_A27                         _L_(0)       /**< HEMC signal line function value: HEMC_A27 */
#define PIO_PG27A_HEMC_A27                         (_U_(1) << 27) /**< HEMC signal: HEMC_A27 */
#define PIN_PG15A_HEMC_BA0                         _L_(207)     /**< HEMC signal: HEMC_BA0 on PG15 mux A */
#define MUX_PG15A_HEMC_BA0                         _L_(0)       /**< HEMC signal line function value: HEMC_BA0 */
#define PIO_PG15A_HEMC_BA0                         (_U_(1) << 15) /**< HEMC signal: HEMC_BA0 */
#define PIN_PG16A_HEMC_BA1                         _L_(208)     /**< HEMC signal: HEMC_BA1 on PG16 mux A */
#define MUX_PG16A_HEMC_BA1                         _L_(0)       /**< HEMC signal line function value: HEMC_BA1 */
#define PIO_PG16A_HEMC_BA1                         (_U_(1) << 16) /**< HEMC signal: HEMC_BA1 */
#define PIN_PF24X1_HEMC_BOOT_MODE                  _L_(184)     /**< HEMC signal: HEMC_BOOT_MODE on PF24 mux X1 */
#define PIO_PF24X1_HEMC_BOOT_MODE                  (_U_(1) << 24) /**< HEMC signal: HEMC_BOOT_MODE */
#define PIN_PF10A_HEMC_CAS                         _L_(170)     /**< HEMC signal: HEMC_CAS on PF10 mux A */
#define MUX_PF10A_HEMC_CAS                         _L_(0)       /**< HEMC signal line function value: HEMC_CAS */
#define PIO_PF10A_HEMC_CAS                         (_U_(1) << 10) /**< HEMC signal: HEMC_CAS */
#define PIN_PE0A_HEMC_CB0                          _L_(128)     /**< HEMC signal: HEMC_CB0 on PE0 mux A */
#define MUX_PE0A_HEMC_CB0                          _L_(0)       /**< HEMC signal line function value: HEMC_CB0 */
#define PIO_PE0A_HEMC_CB0                          (_U_(1) << 0) /**< HEMC signal: HEMC_CB0 */
#define PIN_PE1A_HEMC_CB1                          _L_(129)     /**< HEMC signal: HEMC_CB1 on PE1 mux A */
#define MUX_PE1A_HEMC_CB1                          _L_(0)       /**< HEMC signal line function value: HEMC_CB1 */
#define PIO_PE1A_HEMC_CB1                          (_U_(1) << 1) /**< HEMC signal: HEMC_CB1 */
#define PIN_PE2A_HEMC_CB2                          _L_(130)     /**< HEMC signal: HEMC_CB2 on PE2 mux A */
#define MUX_PE2A_HEMC_CB2                          _L_(0)       /**< HEMC signal line function value: HEMC_CB2 */
#define PIO_PE2A_HEMC_CB2                          (_U_(1) << 2) /**< HEMC signal: HEMC_CB2 */
#define PIN_PE3A_HEMC_CB3                          _L_(131)     /**< HEMC signal: HEMC_CB3 on PE3 mux A */
#define MUX_PE3A_HEMC_CB3                          _L_(0)       /**< HEMC signal line function value: HEMC_CB3 */
#define PIO_PE3A_HEMC_CB3                          (_U_(1) << 3) /**< HEMC signal: HEMC_CB3 */
#define PIN_PE4A_HEMC_CB4                          _L_(132)     /**< HEMC signal: HEMC_CB4 on PE4 mux A */
#define MUX_PE4A_HEMC_CB4                          _L_(0)       /**< HEMC signal line function value: HEMC_CB4 */
#define PIO_PE4A_HEMC_CB4                          (_U_(1) << 4) /**< HEMC signal: HEMC_CB4 */
#define PIN_PE5A_HEMC_CB5                          _L_(133)     /**< HEMC signal: HEMC_CB5 on PE5 mux A */
#define MUX_PE5A_HEMC_CB5                          _L_(0)       /**< HEMC signal line function value: HEMC_CB5 */
#define PIO_PE5A_HEMC_CB5                          (_U_(1) << 5) /**< HEMC signal: HEMC_CB5 */
#define PIN_PE6A_HEMC_CB6                          _L_(134)     /**< HEMC signal: HEMC_CB6 on PE6 mux A */
#define MUX_PE6A_HEMC_CB6                          _L_(0)       /**< HEMC signal line function value: HEMC_CB6 */
#define PIO_PE6A_HEMC_CB6                          (_U_(1) << 6) /**< HEMC signal: HEMC_CB6 */
#define PIN_PE7A_HEMC_CB7                          _L_(135)     /**< HEMC signal: HEMC_CB7 on PE7 mux A */
#define MUX_PE7A_HEMC_CB7                          _L_(0)       /**< HEMC signal line function value: HEMC_CB7 */
#define PIO_PE7A_HEMC_CB7                          (_U_(1) << 7) /**< HEMC signal: HEMC_CB7 */
#define PIN_PE8A_HEMC_CB8                          _L_(136)     /**< HEMC signal: HEMC_CB8 on PE8 mux A */
#define MUX_PE8A_HEMC_CB8                          _L_(0)       /**< HEMC signal line function value: HEMC_CB8 */
#define PIO_PE8A_HEMC_CB8                          (_U_(1) << 8) /**< HEMC signal: HEMC_CB8 */
#define PIN_PE9A_HEMC_CB9                          _L_(137)     /**< HEMC signal: HEMC_CB9 on PE9 mux A */
#define MUX_PE9A_HEMC_CB9                          _L_(0)       /**< HEMC signal line function value: HEMC_CB9 */
#define PIO_PE9A_HEMC_CB9                          (_U_(1) << 9) /**< HEMC signal: HEMC_CB9 */
#define PIN_PE10A_HEMC_CB10                        _L_(138)     /**< HEMC signal: HEMC_CB10 on PE10 mux A */
#define MUX_PE10A_HEMC_CB10                        _L_(0)       /**< HEMC signal line function value: HEMC_CB10 */
#define PIO_PE10A_HEMC_CB10                        (_U_(1) << 10) /**< HEMC signal: HEMC_CB10 */
#define PIN_PE11A_HEMC_CB11                        _L_(139)     /**< HEMC signal: HEMC_CB11 on PE11 mux A */
#define MUX_PE11A_HEMC_CB11                        _L_(0)       /**< HEMC signal line function value: HEMC_CB11 */
#define PIO_PE11A_HEMC_CB11                        (_U_(1) << 11) /**< HEMC signal: HEMC_CB11 */
#define PIN_PE12A_HEMC_CB12                        _L_(140)     /**< HEMC signal: HEMC_CB12 on PE12 mux A */
#define MUX_PE12A_HEMC_CB12                        _L_(0)       /**< HEMC signal line function value: HEMC_CB12 */
#define PIO_PE12A_HEMC_CB12                        (_U_(1) << 12) /**< HEMC signal: HEMC_CB12 */
#define PIN_PC31A_HEMC_CB13                        _L_(95)      /**< HEMC signal: HEMC_CB13 on PC31 mux A */
#define MUX_PC31A_HEMC_CB13                        _L_(0)       /**< HEMC signal line function value: HEMC_CB13 */
#define PIO_PC31A_HEMC_CB13                        (_U_(1) << 31) /**< HEMC signal: HEMC_CB13 */
#define PIN_PC30A_HEMC_CB14                        _L_(94)      /**< HEMC signal: HEMC_CB14 on PC30 mux A */
#define MUX_PC30A_HEMC_CB14                        _L_(0)       /**< HEMC signal line function value: HEMC_CB14 */
#define PIO_PC30A_HEMC_CB14                        (_U_(1) << 30) /**< HEMC signal: HEMC_CB14 */
#define PIN_PC29A_HEMC_CB15                        _L_(93)      /**< HEMC signal: HEMC_CB15 on PC29 mux A */
#define MUX_PC29A_HEMC_CB15                        _L_(0)       /**< HEMC signal line function value: HEMC_CB15 */
#define PIO_PC29A_HEMC_CB15                        (_U_(1) << 29) /**< HEMC signal: HEMC_CB15 */
#define PIN_PG24X1_HEMC_CFG0                       _L_(216)     /**< HEMC signal: HEMC_CFG0 on PG24 mux X1 */
#define PIO_PG24X1_HEMC_CFG0                       (_U_(1) << 24) /**< HEMC signal: HEMC_CFG0 */
#define PIN_PG25X1_HEMC_CFG1                       _L_(217)     /**< HEMC signal: HEMC_CFG1 on PG25 mux X1 */
#define PIO_PG25X1_HEMC_CFG1                       (_U_(1) << 25) /**< HEMC signal: HEMC_CFG1 */
#define PIN_PG26X1_HEMC_CFG2                       _L_(218)     /**< HEMC signal: HEMC_CFG2 on PG26 mux X1 */
#define PIO_PG26X1_HEMC_CFG2                       (_U_(1) << 26) /**< HEMC signal: HEMC_CFG2 */
#define PIN_PG27X1_HEMC_CFG3                       _L_(219)     /**< HEMC signal: HEMC_CFG3 on PG27 mux X1 */
#define PIO_PG27X1_HEMC_CFG3                       (_U_(1) << 27) /**< HEMC signal: HEMC_CFG3 */
#define PIN_PD0A_HEMC_D0                           _L_(96)      /**< HEMC signal: HEMC_D0 on PD0 mux A */
#define MUX_PD0A_HEMC_D0                           _L_(0)       /**< HEMC signal line function value: HEMC_D0 */
#define PIO_PD0A_HEMC_D0                           (_U_(1) << 0) /**< HEMC signal: HEMC_D0 */
#define PIN_PD1A_HEMC_D1                           _L_(97)      /**< HEMC signal: HEMC_D1 on PD1 mux A */
#define MUX_PD1A_HEMC_D1                           _L_(0)       /**< HEMC signal line function value: HEMC_D1 */
#define PIO_PD1A_HEMC_D1                           (_U_(1) << 1) /**< HEMC signal: HEMC_D1 */
#define PIN_PD2A_HEMC_D2                           _L_(98)      /**< HEMC signal: HEMC_D2 on PD2 mux A */
#define MUX_PD2A_HEMC_D2                           _L_(0)       /**< HEMC signal line function value: HEMC_D2 */
#define PIO_PD2A_HEMC_D2                           (_U_(1) << 2) /**< HEMC signal: HEMC_D2 */
#define PIN_PD3A_HEMC_D3                           _L_(99)      /**< HEMC signal: HEMC_D3 on PD3 mux A */
#define MUX_PD3A_HEMC_D3                           _L_(0)       /**< HEMC signal line function value: HEMC_D3 */
#define PIO_PD3A_HEMC_D3                           (_U_(1) << 3) /**< HEMC signal: HEMC_D3 */
#define PIN_PD4A_HEMC_D4                           _L_(100)     /**< HEMC signal: HEMC_D4 on PD4 mux A */
#define MUX_PD4A_HEMC_D4                           _L_(0)       /**< HEMC signal line function value: HEMC_D4 */
#define PIO_PD4A_HEMC_D4                           (_U_(1) << 4) /**< HEMC signal: HEMC_D4 */
#define PIN_PD5A_HEMC_D5                           _L_(101)     /**< HEMC signal: HEMC_D5 on PD5 mux A */
#define MUX_PD5A_HEMC_D5                           _L_(0)       /**< HEMC signal line function value: HEMC_D5 */
#define PIO_PD5A_HEMC_D5                           (_U_(1) << 5) /**< HEMC signal: HEMC_D5 */
#define PIN_PD6A_HEMC_D6                           _L_(102)     /**< HEMC signal: HEMC_D6 on PD6 mux A */
#define MUX_PD6A_HEMC_D6                           _L_(0)       /**< HEMC signal line function value: HEMC_D6 */
#define PIO_PD6A_HEMC_D6                           (_U_(1) << 6) /**< HEMC signal: HEMC_D6 */
#define PIN_PD7A_HEMC_D7                           _L_(103)     /**< HEMC signal: HEMC_D7 on PD7 mux A */
#define MUX_PD7A_HEMC_D7                           _L_(0)       /**< HEMC signal line function value: HEMC_D7 */
#define PIO_PD7A_HEMC_D7                           (_U_(1) << 7) /**< HEMC signal: HEMC_D7 */
#define PIN_PD8A_HEMC_D8                           _L_(104)     /**< HEMC signal: HEMC_D8 on PD8 mux A */
#define MUX_PD8A_HEMC_D8                           _L_(0)       /**< HEMC signal line function value: HEMC_D8 */
#define PIO_PD8A_HEMC_D8                           (_U_(1) << 8) /**< HEMC signal: HEMC_D8 */
#define PIN_PD9A_HEMC_D9                           _L_(105)     /**< HEMC signal: HEMC_D9 on PD9 mux A */
#define MUX_PD9A_HEMC_D9                           _L_(0)       /**< HEMC signal line function value: HEMC_D9 */
#define PIO_PD9A_HEMC_D9                           (_U_(1) << 9) /**< HEMC signal: HEMC_D9 */
#define PIN_PD10A_HEMC_D10                         _L_(106)     /**< HEMC signal: HEMC_D10 on PD10 mux A */
#define MUX_PD10A_HEMC_D10                         _L_(0)       /**< HEMC signal line function value: HEMC_D10 */
#define PIO_PD10A_HEMC_D10                         (_U_(1) << 10) /**< HEMC signal: HEMC_D10 */
#define PIN_PD11A_HEMC_D11                         _L_(107)     /**< HEMC signal: HEMC_D11 on PD11 mux A */
#define MUX_PD11A_HEMC_D11                         _L_(0)       /**< HEMC signal line function value: HEMC_D11 */
#define PIO_PD11A_HEMC_D11                         (_U_(1) << 11) /**< HEMC signal: HEMC_D11 */
#define PIN_PD12A_HEMC_D12                         _L_(108)     /**< HEMC signal: HEMC_D12 on PD12 mux A */
#define MUX_PD12A_HEMC_D12                         _L_(0)       /**< HEMC signal line function value: HEMC_D12 */
#define PIO_PD12A_HEMC_D12                         (_U_(1) << 12) /**< HEMC signal: HEMC_D12 */
#define PIN_PD13A_HEMC_D13                         _L_(109)     /**< HEMC signal: HEMC_D13 on PD13 mux A */
#define MUX_PD13A_HEMC_D13                         _L_(0)       /**< HEMC signal line function value: HEMC_D13 */
#define PIO_PD13A_HEMC_D13                         (_U_(1) << 13) /**< HEMC signal: HEMC_D13 */
#define PIN_PD14A_HEMC_D14                         _L_(110)     /**< HEMC signal: HEMC_D14 on PD14 mux A */
#define MUX_PD14A_HEMC_D14                         _L_(0)       /**< HEMC signal line function value: HEMC_D14 */
#define PIO_PD14A_HEMC_D14                         (_U_(1) << 14) /**< HEMC signal: HEMC_D14 */
#define PIN_PD15A_HEMC_D15                         _L_(111)     /**< HEMC signal: HEMC_D15 on PD15 mux A */
#define MUX_PD15A_HEMC_D15                         _L_(0)       /**< HEMC signal line function value: HEMC_D15 */
#define PIO_PD15A_HEMC_D15                         (_U_(1) << 15) /**< HEMC signal: HEMC_D15 */
#define PIN_PD16A_HEMC_D16                         _L_(112)     /**< HEMC signal: HEMC_D16 on PD16 mux A */
#define MUX_PD16A_HEMC_D16                         _L_(0)       /**< HEMC signal line function value: HEMC_D16 */
#define PIO_PD16A_HEMC_D16                         (_U_(1) << 16) /**< HEMC signal: HEMC_D16 */
#define PIN_PD17A_HEMC_D17                         _L_(113)     /**< HEMC signal: HEMC_D17 on PD17 mux A */
#define MUX_PD17A_HEMC_D17                         _L_(0)       /**< HEMC signal line function value: HEMC_D17 */
#define PIO_PD17A_HEMC_D17                         (_U_(1) << 17) /**< HEMC signal: HEMC_D17 */
#define PIN_PD18A_HEMC_D18                         _L_(114)     /**< HEMC signal: HEMC_D18 on PD18 mux A */
#define MUX_PD18A_HEMC_D18                         _L_(0)       /**< HEMC signal line function value: HEMC_D18 */
#define PIO_PD18A_HEMC_D18                         (_U_(1) << 18) /**< HEMC signal: HEMC_D18 */
#define PIN_PD19A_HEMC_D19                         _L_(115)     /**< HEMC signal: HEMC_D19 on PD19 mux A */
#define MUX_PD19A_HEMC_D19                         _L_(0)       /**< HEMC signal line function value: HEMC_D19 */
#define PIO_PD19A_HEMC_D19                         (_U_(1) << 19) /**< HEMC signal: HEMC_D19 */
#define PIN_PD20A_HEMC_D20                         _L_(116)     /**< HEMC signal: HEMC_D20 on PD20 mux A */
#define MUX_PD20A_HEMC_D20                         _L_(0)       /**< HEMC signal line function value: HEMC_D20 */
#define PIO_PD20A_HEMC_D20                         (_U_(1) << 20) /**< HEMC signal: HEMC_D20 */
#define PIN_PD21A_HEMC_D21                         _L_(117)     /**< HEMC signal: HEMC_D21 on PD21 mux A */
#define MUX_PD21A_HEMC_D21                         _L_(0)       /**< HEMC signal line function value: HEMC_D21 */
#define PIO_PD21A_HEMC_D21                         (_U_(1) << 21) /**< HEMC signal: HEMC_D21 */
#define PIN_PD22A_HEMC_D22                         _L_(118)     /**< HEMC signal: HEMC_D22 on PD22 mux A */
#define MUX_PD22A_HEMC_D22                         _L_(0)       /**< HEMC signal line function value: HEMC_D22 */
#define PIO_PD22A_HEMC_D22                         (_U_(1) << 22) /**< HEMC signal: HEMC_D22 */
#define PIN_PD23A_HEMC_D23                         _L_(119)     /**< HEMC signal: HEMC_D23 on PD23 mux A */
#define MUX_PD23A_HEMC_D23                         _L_(0)       /**< HEMC signal line function value: HEMC_D23 */
#define PIO_PD23A_HEMC_D23                         (_U_(1) << 23) /**< HEMC signal: HEMC_D23 */
#define PIN_PD24A_HEMC_D24                         _L_(120)     /**< HEMC signal: HEMC_D24 on PD24 mux A */
#define MUX_PD24A_HEMC_D24                         _L_(0)       /**< HEMC signal line function value: HEMC_D24 */
#define PIO_PD24A_HEMC_D24                         (_U_(1) << 24) /**< HEMC signal: HEMC_D24 */
#define PIN_PD25A_HEMC_D25                         _L_(121)     /**< HEMC signal: HEMC_D25 on PD25 mux A */
#define MUX_PD25A_HEMC_D25                         _L_(0)       /**< HEMC signal line function value: HEMC_D25 */
#define PIO_PD25A_HEMC_D25                         (_U_(1) << 25) /**< HEMC signal: HEMC_D25 */
#define PIN_PD26A_HEMC_D26                         _L_(122)     /**< HEMC signal: HEMC_D26 on PD26 mux A */
#define MUX_PD26A_HEMC_D26                         _L_(0)       /**< HEMC signal line function value: HEMC_D26 */
